ERP DEV.WMS/src/DataProcessors/вмс_ОтчетБиллинг/вмс_ОтчетБиллинг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>вмс_ОтчетБиллинг</name>
  <attributes>
    <name>Результат</name>
    <type>
      <types>SpreadsheetDocument</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

ERP DEV.WMS/src/AccumulationRegisters/вмс_РазовыеОперацииХранения/вмс_РазовыеОперацииХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вмс_РазовыеОперацииХранения</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>CatalogRef.вмс_УслугиОтветственногоХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контейнер</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаХранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP DEV.WMS/src/AccumulationRegisters/вмс_ПосуточныеОперацииХранения/вмс_ПосуточныеОперацииХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вмс_ПосуточныеОперацииХранения</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>CatalogRef.вмс_УслугиОтветственногоХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контейнер</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаХранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP DEV.WMS/src/DataProcessors/вмс_ОтчетБиллинг/Forms/ФормаОтчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	Отчет.ПериодОтчета = Новый СтандартныйПериод;
	Отчет.ПериодОтчета.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Отчет.ПериодОтчета.ДатаОкончания = ТекущаяДата();
	
	ПараметрДанных= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	ПараметрДанных.Значение = Отчет.ПериодОтчета;
	ПараметрДанных.Использование=Истина; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы  

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если Отчет.ПериодОтчета.ДатаНачала > Отчет.ПериодОтчета.ДатаОкончания Тогда
		
		Перенос = Отчет.ПериодОтчета.ДатаНачала;
		Отчет.ПериодОтчета.ДатаНачала = Отчет.ПериодОтчета.ДатаОкончания;
		Отчет.ПериодОтчета.ДатаОкончания = Перенос;
		
	КонецЕсли;
	
	Если Отчет.ПериодОтчета.ДатаОкончания > ТекущаяДата() Тогда
		
		Отчет.ПериодОтчета.ДатаОкончания = ТекущаяДата();
		
	КонецЕсли;
	
	Если Отчет.ПериодОтчета.ДатаНачала > ТекущаяДата() Тогда
		
		Отчет.ПериодОтчета.ДатаНачала = ТекущаяДата();
		
	КонецЕсли;
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	ПараметрДанных.Значение = Отчет.ПериодОтчета;
	ПараметрДанных.Использование=Истина; 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных("Контрагент");
	
	// найдем отбор
	ЭлементОтбора = Неопределено;
	Для Каждого Отбор Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Отбор.ЛевоеЗначение = ПолеОтбора Тогда
			ЭлементОтбора = Отбор;
			Прервать
		КонецЕсли;
	КонецЦикла;
	
	// если не нашли, то создадим
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Контрагент;
	Иначе
		ЭлементОтбора.Использование = Ложь;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура СкладПриИзменении(Элемент) 
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных("Склад");
	
	// найдем отбор
	ЭлементОтбора = Неопределено;
	Для Каждого Отбор Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Отбор.ЛевоеЗначение = ПолеОтбора Тогда
			ЭлементОтбора = Отбор;
			Прервать
		КонецЕсли;
	КонецЦикла;
	
	// если не нашли, то создадим
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Склад) Тогда
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Склад;
	Иначе
		ЭлементОтбора.Использование = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы  

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере() 
	
	Результат.Очистить();
	
	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанных"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказПокупателя(Команда)
	РезультатСоздания = СоздатьЗаказ(Отчет.ПериодОтчета, Контрагент);
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьЗаказ(Период, Контрагент);
	
	Запрос = ЗапросПоУслугам(Период, Контрагент);
	Таблица = Запрос.Выполнить().Выгрузить();
	
	НовыйДокумент = Неопределено; 
	СтрокаЗаписи = Новый Структура;
	СтрокаЗаписи.Вставить("Контрагент"); 
	СтрокаЗаписи.Вставить("Организация");
	СтрокаЗаписи.Вставить("Вид");
	МассивДокументов = Новый Массив;    
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	вмс_УслугиОтветственногоХранения.Номенклатура КАК Номенклатура
	|ИЗ
	|	Справочник.вмс_УслугиОтветственногоХранения КАК вмс_УслугиОтветственногоХранения
	|ГДЕ
	|	вмс_УслугиОтветственногоХранения.Ссылка = &Ссылка";
	
	//ТУ_Кошелев 11.12.24 - Адаптация под УНФ; вызов метода Заполнить() после создания документа, для корректного отображения в списке и заполнения всех необходимых полей
	КонфигурацияУНФ = вмс_АдаптацияКонфигураций.ЭтоУНФ();
	Для каждого Строка Из Таблица Цикл  
		
		Если Строка.Вид = "Услуги" Тогда 
			
			Если СтрокаЗаписи.Контрагент <> Строка.Контрагент ИЛИ СтрокаЗаписи.Организация <> Строка.Организация Тогда
				
				Если КонфигурацияУНФ Тогда
					
					НовыйДокумент = Документы.ЗаказПокупателя.СоздатьДокумент();
					НовыйДокумент.Заполнить(Неопределено);
					
					НовыйДокумент.Контрагент = Строка.Контрагент;
					НовыйДокумент.Организация = Строка.Организация;
					НовыйДокумент.Дата = ТекущаяДата(); 
					
					НовыйДокумент.СуммаВключаетНДС = Истина;
					НовыйДокумент.ВалютаДокумента = Константы.ВалютаУчета.Получить();
					НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
					ДокументСтруктура = Новый Структура;
					ДокументСтруктура.Вставить("Документ");
					ДокументСтруктура.Вставить("Контрагент", НовыйДокумент.Контрагент);
					ДокументСтруктура.Вставить("Организация", НовыйДокумент.Организация);
				Иначе
					
					НовыйДокумент = Документы.ЗаказКлиента.СоздатьДокумент();
					НовыйДокумент.Заполнить(Неопределено);
					
					НовыйДокумент.Контрагент = Строка.Контрагент;
					НовыйДокумент.Организация = Строка.Организация;
					НовыйДокумент.Дата = ТекущаяДата(); 
					
					НовыйДокумент.Партнер = Строка.Контрагент.Партнер;  
					НовыйДокумент.ЦенаВключаетНДС = Истина;
					НовыйДокумент.Валюта =  Константы.ВалютаРегламентированногоУчета.Получить();
					НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
					НовыйДокумент.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению; 
					НовыйДокумент.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
					НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
					ДокументСтруктура = Новый Структура;
					ДокументСтруктура.Вставить("Документ");
					ДокументСтруктура.Вставить("Контрагент", НовыйДокумент.Контрагент);
					ДокументСтруктура.Вставить("Организация", НовыйДокумент.Организация);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Строка.Вид = "Хранение" Тогда  
			
			НайденныйДокумент = Неопределено;
			
			Для каждого Документ Из МассивДокументов Цикл
				
				Если Документ.Контрагент = Строка.Контрагент И Документ.Организация = Строка.Организация Тогда
					НайденныйДокумент = Документ;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НайденныйДокумент = Неопределено Тогда
				
				Если КонфигурацияУНФ Тогда
					
					НовыйДокумент = Документы.ЗаказПокупателя.СоздатьДокумент();
					НовыйДокумент.Заполнить(Неопределено);
					
					НовыйДокумент.Контрагент = Строка.Контрагент;
					НовыйДокумент.Организация = Строка.Организация;
					НовыйДокумент.Дата = ТекущаяДата();
					
					НовыйДокумент.СуммаВключаетНДС = Истина;
					НовыйДокумент.ВалютаДокумента = Константы.ВалютаУчета.Получить();
					НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
				Иначе   
					
					НовыйДокумент = Документы.ЗаказКлиента.СоздатьДокумент();
					НовыйДокумент.Заполнить(Неопределено);
					
					НовыйДокумент.Контрагент = Строка.Контрагент;
					НовыйДокумент.Организация = Строка.Организация;
					НовыйДокумент.Дата = ТекущаяДата();
					
					НовыйДокумент.Партнер = Строка.Контрагент.Партнер;
					НовыйДокумент.ЦенаВключаетНДС = Истина;
					НовыйДокумент.Валюта =  Константы.ВалютаРегламентированногоУчета.Получить();
					НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
					НовыйДокумент.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению; 
					НовыйДокумент.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
					НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
				КонецЕсли;
			Иначе
				Отбор = Новый Структура;
				Отбор.Вставить("Содержание", Строка.Операция);
				
				//ТУ_Августинович ++ 20.03.2026
				// - В УНФ используются Запасы вместо Товары
				НаименованиеТЧ = ?(КонфигурацияУНФ, "Запасы", "Товары");
				
				Если НайденныйДокумент[НаименованиеТЧ].НайтиСтроки(Отбор).Количество() <> 0 Тогда
				//ТУ_Августинович -- 20.03.2026
					
					Если КонфигурацияУНФ Тогда
						
						НовыйДокумент = Документы.ЗаказПокупателя.СоздатьДокумент();
						НовыйДокумент.Заполнить(Неопределено);
						
						НовыйДокумент.Контрагент = Строка.Контрагент;
						НовыйДокумент.Организация = Строка.Организация;
						НовыйДокумент.Дата = ТекущаяДата();
						
						
						НовыйДокумент.СуммаВключаетНДС = Истина;
						НовыйДокумент.ВалютаДокумента = Константы.ВалютаУчета.Получить();
						НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
					Иначе 
						
						НовыйДокумент = Документы.ЗаказКлиента.СоздатьДокумент();
						НовыйДокумент.Заполнить(Неопределено);
						
						НовыйДокумент.Контрагент = Строка.Контрагент;
						НовыйДокумент.Организация = Строка.Организация;
						НовыйДокумент.Дата = ТекущаяДата();
						
						
						НовыйДокумент.Партнер = Строка.Контрагент.Партнер;  
						НовыйДокумент.ЦенаВключаетНДС = Истина;  
						НовыйДокумент.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
						НовыйДокумент.Валюта =  Константы.ВалютаРегламентированногоУчета.Получить();  
						НовыйДокумент.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению; 
						НовыйДокумент.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
						НовыйДокумент.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
					КонецЕсли;
					
				Иначе
					НовыйДокумент = НайденныйДокумент;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаЗаписи = Строка;
		
		Если КонфигурацияУНФ Тогда
			СтрокаТЧ = НовыйДокумент.Запасы.Добавить();
			Запрос.УстановитьПараметр("Ссылка", Строка.Операция);
			Выборка = Запрос.Выполнить().Выбрать();
			Выборка.Следующий();
			СтрокаТЧ.Номенклатура = Выборка.Номенклатура;
			СтрокаТЧ.Содержание = СтрокаЗаписи.Операция;
			СтрокаТЧ.Количество = СтрокаЗаписи.Количество;
			СтрокаТЧ.Сумма = СтрокаЗаписи.Сумма;
			СтрокаТЧ.Цена = СтрокаЗаписи.Сумма / СтрокаЗаписи.Количество;
			ОбработатьСтрокуТабличнойЧасти(СтрокаТЧ, НовыйДокумент);
		Иначе
			СтрокаТЧ = НовыйДокумент.Товары.Добавить();
			Запрос.УстановитьПараметр("Ссылка", Строка.Операция);
			Выборка = Запрос.Выполнить().Выбрать();
			Выборка.Следующий();
			СтрокаТЧ.Номенклатура = Выборка.Номенклатура;
			СтрокаТЧ.Содержание = СтрокаЗаписи.Операция;
			СтрокаТЧ.Количество = СтрокаЗаписи.Количество;
			СтрокаТЧ.КоличествоУпаковок = СтрокаЗаписи.Количество;
			СтрокаТЧ.Сумма = СтрокаЗаписи.Сумма;
			СтрокаТЧ.Цена = СтрокаЗаписи.Сумма / СтрокаЗаписи.Количество;  
			СтрокаТЧ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется;
			СтрокаТЧ.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("20%");
			ОбработатьСтрокуТабличнойЧасти(СтрокаТЧ, НовыйДокумент);
		КонецЕсли;
		
		НайденныйДокумент = Неопределено;
		
		Для каждого Документ Из МассивДокументов Цикл
			
			Если Документ.Контрагент = Строка.Контрагент И Документ.Организация = Строка.Организация Тогда
				НайденныйДокумент = Документ;
				Прервать;
			КонецЕсли;
			
		КонецЦикла; 
		
		Если НайденныйДокумент = Неопределено Тогда
			МассивДокументов.Добавить(НовыйДокумент);
		Иначе
			НайденныйДокумент = НовыйДокумент;
		КонецЕсли;
		
	КонецЦикла; 
	
	Для каждого Документ Из МассивДокументов Цикл
		
		//ТУ_Прошин_11.04.24++  
		Если КонфигурацияУНФ Тогда
			//ТУ_Августинович ++ 20.03.2026
			// - В табличной части Запасы может не быть колонки СуммаСНДС.
			//	 Поэтому была реализована проверка существоания данной колонки
			
			ИтоговаяСумма = 0;
			
			Если Документ.Запасы.Найти("СуммаСНДС") <> Неопределено Тогда
				ИтоговаяСумма = Документ.Запасы.Итог("СуммаСНДС");
			ИначеЕсли Документ.Запасы.Найти("Всего") <> Неопределено Тогда
				ИтоговаяСумма = Документ.Запасы.Итог("Всего");
			КонецЕсли;
			//ТУ_Августинович -- 20.03.2026
			
			Документ.СуммаДокумента = ИтоговаяСумма;
		Иначе
			ИтоговаяСумма = Документ.Товары.Итог("СуммаСНДС");
			Документ.СуммаДокумента = ИтоговаяСумма;
		КонецЕсли;
		//ТУ_Прошин_11.04.24--
		
		Документ.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОбработатьСтрокуТабличнойЧасти(СтрокаТабличнойЧасти, Документ) 
	
	// ТУ_Алфимов 04.09.26 ++
	//Если вмс_АдаптацияКонфигураций.ЭтоУТ() Тогда
	//	
	//	СтруктураПересчетаСуммы = Новый Структура;
	//	
	//	Выполнить("СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Документ)"); 
	//	СтруктураДействий = Новый Структура; 
	//	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	//	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	//	СтруктураДействий.Вставить("ПересчитатьСумму");
	//	Выполнить("ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТабличнойЧасти, СтруктураДействий, Неопределено)");
	//	
	//КонецЕсли;
	
	
	Если вмс_АдаптацияКонфигураций.ЭтоЕРП() ИЛИ вмс_АдаптацияКонфигураций.ЭтоУТ() Тогда // ТУ_Алфимов 04.09.26 --
		
		СтруктураПересчетаСуммы = Новый Структура;
		
		Выполнить("СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Документ)"); 
		СтруктураДействий = Новый Структура; 
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");
		Выполнить("ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТабличнойЧасти, СтруктураДействий, Неопределено)");
		
	КонецЕсли;
	
	Если вмс_АдаптацияКонфигураций.ЭтоУНФ() Тогда
		
		ПараметрыРасчета = Новый Структура("СброситьФлагСкидкиРассчитаны",Истина);
		ПараметрыРасчета.Вставить("СуммаВключаетНДС",Документ.СуммаВключаетНДС);
		ПараметрыРасчета.Вставить("ИспользоватьМинимальныеЦены", Ложь);
		
		Выполнить("ТабличныеЧастиУНФКлиентСервер.РассчитатьСуммыВСтрокеТЧ(СтрокаТабличнойЧасти, ПараметрыРасчета)");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапросПоУслугам(Период, Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, aa.a * 1000 + bb.b * 100 + cc.c * 10 + dd.d) КАК Период
	|ПОМЕСТИТЬ ВТ_ДниРасчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		0 КАК a
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		1
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		2
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		3
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		4
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		5
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		6
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		7
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		8
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		9) КАК aa
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			0 КАК b
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			1
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			2
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			3
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			4
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			5
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			6
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			7
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			8
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			9) КАК bb
	|		ПО (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			0 КАК c
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			1
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			2
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			3
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			4
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			5
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			6
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			7
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			8
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			9) КАК cc
	|		ПО (ИСТИНА)
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			0 КАК d
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			1
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			2
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			3
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			4
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			5
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			6
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			7
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			8
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			9) КАК dd
	|		ПО (ИСТИНА)
	|ГДЕ
	|	aa.a * 1000 + bb.b * 100 + cc.c * 10 + dd.d <= РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДниРасчета.Период КАК Период,
	|	УслугиХранения.Контрагент КАК Контрагент,
	|	УслугиХранения.Организация КАК Организация,
	|	УслугиХранения.Операция КАК Операция,
	|	SQRT(POW(УслугиХранения.СуммаОборот, 2)) КАК Сумма,
	|	SQRT(POW(УслугиХранения.КоличествоОборот, 2)) КАК Количество,
	|	""Услуги"" КАК Вид
	|ПОМЕСТИТЬ ВТ_ОборотыУслуг
	|ИЗ
	|	ВТ_ДниРасчета КАК ВТ_ДниРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_РазовыеОперацииХранения.Обороты(, , День, Контрагент В (&Контрагент)) КАК УслугиХранения
	|		ПО ВТ_ДниРасчета.Период = УслугиХранения.Период
	|ГДЕ
	|	НЕ УслугиХранения.Контрагент ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДниРасчета.Период КАК Период,
	|	Хранение.Контрагент КАК Контрагент,
	|	Хранение.Организация КАК Организация,
	|	1 КАК Количество,
	|	""Хранение"" КАК Вид,
	|	СУММА(ВЫБОР
	|			КОГДА Хранение.Период = &НачалоПериода
	|				ТОГДА Хранение.СуммаКонечныйОстаток
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Хранение.Период <= ВТ_ДниРасчета.Период
	|						ТОГДА Хранение.СуммаОборот
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ) КАК Сумма,
	|	Хранение.Операция КАК Операция
	|ПОМЕСТИТЬ ВТ_Хранение
	|ИЗ
	|	ВТ_ДниРасчета КАК ВТ_ДниРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ПосуточныеОперацииХранения.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , Контрагент В (&Контрагент)) КАК Хранение
	|		ПО (Хранение.Период <= ВТ_ДниРасчета.Период)
	|ГДЕ
	|	НЕ Хранение.Контрагент ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДниРасчета.Период,
	|	Хранение.Контрагент,
	|	Хранение.Организация,
	|	Хранение.Операция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОборотыУслуг.Контрагент КАК Контрагент,
	|	ВТ_ОборотыУслуг.Организация КАК Организация,
	|	ВТ_ОборотыУслуг.Операция КАК Операция,
	|	СУММА(ВТ_ОборотыУслуг.Сумма) КАК Сумма,
	|	СУММА(ВТ_ОборотыУслуг.Количество) КАК Количество,
	|	ВТ_ОборотыУслуг.Вид КАК Вид
	|ИЗ
	|	ВТ_ОборотыУслуг КАК ВТ_ОборотыУслуг
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОборотыУслуг.Контрагент,
	|	ВТ_ОборотыУслуг.Организация,
	|	ВТ_ОборотыУслуг.Операция,
	|	ВТ_ОборотыУслуг.Вид
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Хранение.Контрагент,
	|	ВТ_Хранение.Организация,
	|	ВТ_Хранение.Операция,
	|	СУММА(ВТ_Хранение.Сумма),
	|	СУММА(ВТ_Хранение.Количество),
	|	ВТ_Хранение.Вид
	|ИЗ
	|	ВТ_Хранение КАК ВТ_Хранение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Хранение.Контрагент,
	|	ВТ_Хранение.Организация,
	|	ВТ_Хранение.Операция,
	|	ВТ_Хранение.Вид";    
	
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти
